import 'package:qwe1/models/meal.dart';

List elements = [
  {'name': 'Кефир с мюсли', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '260 гр'},
  {'name': 'Компот абрикосовый', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '432 гр'},
  {'name': 'Хлеб из муки', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '260 гр'},
  {'name': 'Бана', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '23 гр'},
  {'name': 'Творог', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '74 гр'},
  {'name': 'Сметана', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '45 гр'},
  {'name': 'Кофе растворимый', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '63 гр'},
  {'name': 'Сыр камамбер', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '27 гр'},
  {'name': 'Рыба сырая', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '342 гр'},
  {'name': 'Чеснок', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '224 гр'},
  {'name': 'Компот сливовый', 'group': 'ДРУГАЯ КАТЕГОРИЯ', 'qwe': '543 гр'},
  {'name': 'Питьевая вода', 'group': 'цВОДА', 'qwe': '2739 гр'},
  {
    'name': 'Пшеничная мука',
    'group': 'КРУПЫ И ЗЕРНОВЫЕ, ВКЛ МУКУ',
    'qwe': '536 гр'
  },
  {
    'name': 'Овсянные хлопья',
    'group': 'КРУПЫ И ЗЕРНОВЫЕ, ВКЛ МУКУ',
    'qwe': '24 гр'
  },
  {
    'name': 'Кукурузная крупа',
    'group': 'КРУПЫ И ЗЕРНОВЫЕ, ВКЛ МУКУ',
    'qwe': '84 гр'
  },
  {'name': 'Оливковое масло', 'group': 'МАСЛА РАСТИТЕЛЬНЫЕ', 'qwe': '144 гр'},
  {'name': 'Панировочнеы сухари', 'group': 'РАЗНОЕ', 'qwe': '143 гр'},
  {'name': 'Какао порошок', 'group': 'РАЗНОЕ', 'qwe': '34 гр'},
  {'name': 'Сливки', 'group': 'РАЗНОЕ', 'qwe': '531 гр'},
  {'name': 'Разрыхлители', 'group': 'РАЗНОЕ', 'qwe': '351 гр'},
  {'name': 'Мускатный орех', 'group': 'РАЗНОЕ', 'qwe': '63 гр'},
  {'name': 'Дрожжи', 'group': 'РАЗНОЕ', 'qwe': '73 гр'},
  {'name': 'Ванилин сахар', 'group': 'РАЗНОЕ', 'qwe': '34 гр'},
  {'name': 'Крахмал', 'group': 'РАЗНОЕ', 'qwe': '154 гр'},
  {'name': 'Морская соль', 'group': 'СОЛЬ', 'qwe': '42 гр'},
  {'name': 'Соль', 'group': 'СОЛЬ', 'qwe': '65 гр'},
  {'name': 'Листья салата латук', 'group': 'ОВОЩИ И ЗАМОРОЖ', 'qwe': '73 гр'},
  {'name': 'Цветная капуста', 'group': 'ОВОЩИ И ЗАМОРОЖ', 'qwe': '12 гр'},
  {'name': 'Помидоры ', 'group': 'ОВОЩИ И ЗАМОРОЖ', 'qwe': '643 гр'},
  {'name': 'Морковь сырая', 'group': 'ОВОЩИ И ЗАМОРОЖ', 'qwe': '35 гр'},
  {
    'name': 'Красная капуста сырая',
    'group': 'ОВОЩИ И ЗАМОРОЖ',
    'qwe': '521 гр'
  },
  {'name': 'Укроп сырой', 'group': 'ОВОЩИ И ЗАМОРОЖ', 'qwe': '675 гр'},
  {'name': 'Перец', 'group': 'СПЕЦИИ И ПРИПРАВЫ', 'qwe': '342 гр'},
  {'name': 'Перец черный', 'group': 'СПЕЦИИ И ПРИПРАВЫ', 'qwe': '23 гр'},
  {'name': 'Яблочный уксус', 'group': 'СПЕЦИИ И ПРИПРАВЫ', 'qwe': '123 гр'},
  {'name': 'Уксус', 'group': 'СПЕЦИИ И ПРИПРАВЫ', 'qwe': '342 гр'},
  {
    'name': 'Бальзамическии уксус',
    'group': 'СПЕЦИИ И ПРИПРАВЫ',
    'qwe': '52 гр'
  },
  {
    'name': 'Булочка из пшеницы',
    'group': 'ХЛЕБ И ХЛЕБОБУЛОЧНЫЕ ИЗДЕЛИЯ',
    'qwe': '532 гр'
  },
  {'name': 'Хлеб', 'group': 'ХЛЕБ И ХЛЕБОБУЛОЧНЫЕ ИЗДЕЛИЯ', 'qwe': '23 гр'},
  {'name': 'Куриное яйцо', 'group': 'ЯЙЦА', 'qwe': '432 гр'},
];

final DUMMY_MEALS = [
  Meal(
    title1: 'qwe',
    title2: 'asd',
    image: 'assets/images/asd.jpg',
  ),
  Meal(
    title1: 'zxc',
    title2: 'rty',
    image: 'assets/images/asd.jpg',
  ),
];
